{
  "id": "angular-frontend",
  "title": "Evaluación Técnica Senior - Especialista en Angular",
  "categories": [
    {
      "id": "frontend-architecture-core",
      "title": "Arquitectura Frontend y Core de Angular",
      "questions": [
        {
          "id": "spa-frameworks",
          "question": "¿Cuál es tu nivel de dominio en el ecosistema de Angular, incluyendo el ciclo de vida de componentes y el uso de Standalone Components?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Migración de un módulo tradicional a Standalone Components y uso de inject() en lugar de constructor para Dependency Injection."
        },
        {
          "id": "clean-code-solid",
          "question": "¿Qué tan capaz eres de aplicar principios SOLID y patrones de diseño específicos en el desarrollo de interfaces y servicios en Angular?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Aplicación del principio de Responsabilidad Única mediante la creación de Servicios de Fachada para desacoplar componentes de la lógica de negocio compleja."
        },
        {
          "id": "architectural-patterns",
          "question": "¿Qué experiencia tienes implementando patrones arquitectónicos como Clean Architecture o Arquitectura Hexagonal en proyectos Angular?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Estructuración de carpetas por capas (Core, Features, Shared) y uso de librerías como Nx para gestionar monorepos con límites claros de dominio."
        }
      ]
    },
    {
      "id": "data-integration-security",
      "title": "Integración de Datos, API y Seguridad",
      "questions": [
        {
          "id": "api-rest-standards",
          "question": "¿Qué tanto dominas la integración de Angular con APIs RESTful, incluyendo el manejo de interceptores y tipado estricto?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Configuración de un HttpInterceptor para adjuntar tokens Bearer de forma centralizada y manejo de modelos mediante Interfaces/Typescript."
        },
        {
          "id": "authentication-authorization",
          "question": "¿Cuál es tu experiencia implementando flujos de autenticación (OAuth2/OIDC) y guardias de navegación en Angular?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Implementación de CanActivateFn y CanMatch para proteger rutas basadas en roles de usuario extraídos de un JWT."
        },
        {
          "id": "secrets-management",
          "question": "¿Cómo gestionas la seguridad de variables de entorno y claves de API dentro de una aplicación Angular?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Uso de environment files y configuración de procesos de CI/CD para inyectar claves sensibles mediante scripts antes del build de producción."
        }
      ]
    },
    {
      "id": "testing-quality",
      "title": "Calidad, Testing y Resiliencia",
      "questions": [
        {
          "id": "unit-testing-mocking",
          "question": "¿Qué tan experimentado estás en la creación de pruebas unitarias para componentes y servicios utilizando Jasmine/Jest?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Uso de SpyObj para mockear servicios externos y asegurar que un componente emita un evento correctamente bajo una condición específica."
        },
        {
          "id": "integration-testing",
          "question": "¿Cuál es tu dominio en pruebas de integración para validar la interacción entre múltiples componentes o con el DOM?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Uso de TestBed para renderizar un componente y verificar que los cambios en un input se reflejen correctamente en la UI tras un evento de click."
        },
        {
          "id": "resilience-fault-tolerance",
          "question": "¿Qué experiencia tienes manejando errores de red y estrategias de reintento en el flujo de datos (RxJS)?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Implementación de operadores como retry() o catchError() en un Pipe de RxJS para manejar fallos de red de forma transparente al usuario."
        }
      ]
    },
    {
      "id": "ops-dev-efficiency",
      "title": "Infraestructura, DevOps y Documentación",
      "questions": [
        {
          "id": "ci-cd-automation",
          "question": "¿Qué tanto conoces sobre la automatización de despliegues y optimización de builds (AOT/Ivy) para aplicaciones Angular?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Configuración de un pipeline en GitHub Actions o Azure DevOps para ejecutar linting, tests y build con optimización de 'Tree Shaking'."
        },
        {
          "id": "containerization-tech",
          "question": "¿Qué experiencia tienes dockerizando aplicaciones Angular para entornos de desarrollo o producción?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Creación de un Dockerfile multi-stage que compila la app y utiliza Nginx para servir los archivos estáticos de forma eficiente."
        },
        {
          "id": "technical-documentation",
          "question": "¿Cuál es tu capacidad para documentar arquitecturas de frontend y componentes de librería (ej. Compodoc o Storybook)?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Mantenimiento de un catálogo de componentes en Storybook para facilitar la colaboración con diseñadores y otros desarrolladores."
        },
        {
          "id": "collaborative-programming",
          "question": "¿Qué tanta experiencia tienes liderando revisiones de código (Code Reviews) o realizando Pair Programming en equipos Angular?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Identificación de 'Code Smells' en PRs ajenos, como suscripciones manuales anidadas en lugar de usar el pipe async o operadores de transformación."
        }
      ]
    }
  ]
}