{
  "id": "dotnet-backend",
  "title": "Evaluación de Expertiz en Ecosistema .NET",
  "categories": [
    {
      "id": "backend-architecture",
      "title": "Arquitectura y Desarrollo Backend",
      "questions": [
        {
          "id": "backend-framework-mastery",
          "question": "¿Qué nivel de dominio posees en ASP.NET Core, incluyendo el manejo del Kestrel, Middleware y el ciclo de vida de las solicitudes?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Configuración de un Middleware personalizado para el logueo de tiempo de respuesta y optimización de servicios mediante el uso de IServiceCollection."
        },
        {
          "id": "clean-code-solid",
          "question": "¿Cómo calificarías tu habilidad para aplicar SOLID y Clean Code específicamente en proyectos de C# de gran escala?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Uso de interfaces para desacoplar el acceso a datos y aplicación del principio de segregación de interfaces para evitar 'fat interfaces' en servicios de negocio."
        },
        {
          "id": "architectural-patterns",
          "question": "¿Qué tanta experiencia tienes implementando patrones como Onion Architecture, Hexagonal o Clean Architecture en .NET?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Separación de la lógica de dominio en una librería de clases pura (sin dependencias externas) y uso de Application Core para orquestar casos de uso."
        },
        {
          "id": "resilience-fault-tolerance",
          "question": "¿Cuál es tu nivel de conocimiento implementando resiliencia en microservicios .NET utilizando librerías como Polly?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Configuración de una política de 'Circuit Breaker' y 'Retry' con exponencial backoff para llamadas externas vía IHttpClientFactory."
        }
      ]
    },
    {
      "id": "data-persistence",
      "title": "Persistencia de Datos e Integración",
      "questions": [
        {
          "id": "sql-optimization",
          "question": "¿Qué tanta experiencia tienes optimizando consultas SQL y trabajando con Entity Framework Core (LINQ optimization)?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Identificación de problemas de 'N+1', uso de AsNoTracking() para consultas de solo lectura y optimización de índices mediante migraciones."
        },
        {
          "id": "nosql-data-modeling",
          "question": "¿Cómo calificarías tu experiencia integrando y modelando datos en bases de datos NoSQL (ej. MongoDB, CosmosDB) desde .NET?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Diseño de colecciones en MongoDB utilizando el driver oficial de .NET y manejo de documentos embebidos vs referenciados según la frecuencia de acceso."
        },
        {
          "id": "messaging-queues-brokers",
          "question": "¿Qué nivel de dominio tienes en comunicación asíncrona utilizando Message Brokers (RabbitMQ, Azure Service Bus) con .NET?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Implementación de un consumidor de mensajes utilizando BackgroundServices (Worker Services) y el patrón Pub/Sub con MassTransit."
        }
      ]
    },
    {
      "id": "quality-security",
      "title": "Calidad, Pruebas y Seguridad",
      "questions": [
        {
          "id": "unit-testing-mocking",
          "question": "¿Qué tan autónomo eres creando suites de pruebas unitarias robustas con xUnit/NUnit y Moq/NSubstitute?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Pruebas de servicios de negocio mockeando el DbContext o servicios externos, asegurando un code coverage superior al 80% en lógica crítica."
        },
        {
          "id": "authentication-authorization",
          "question": "¿Cuál es tu experiencia implementando seguridad con IdentityServer, JWT o esquemas basados en Policy/Claims en .NET?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Configuración de políticas de autorización basadas en Claims personalizadas y validación de tokens JWT en el pipeline de ASP.NET Core."
        },
        {
          "id": "secrets-management",
          "question": "¿Cómo gestionas la configuración sensible (connection strings, API keys) en entornos productivos de .NET?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Integración de Azure Key Vault o AWS Secrets Manager con el IConfiguration de .NET para inyectar secretos en tiempo de ejecución."
        }
      ]
    },
    {
      "id": "infrastructure-devops",
      "title": "Infraestructura, DevOps y Escalabilidad",
      "questions": [
        {
          "id": "containerization-tech",
          "question": "¿Qué nivel de conocimiento tienes dockerizando aplicaciones .NET y optimizando imágenes (multi-stage builds)?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Creación de Dockerfiles eficientes que separan la restauración de paquetes NuGet del proceso de compilación y publicación."
        },
        {
          "id": "ci-cd-automation",
          "question": "¿Qué tanta experiencia tienes configurando pipelines de CI/CD para el despliegue automático de soluciones .NET?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Configuración de YAML en Azure Pipelines o GitHub Actions para ejecutar dotnet test, sonarcloud y despliegue a App Services."
        },
        {
          "id": "monitoring-alerting",
          "question": "¿Cuál es tu experiencia implementando observabilidad en .NET (Application Insights, Serilog, OpenTelemetry)?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Implementación de Structured Logging con Serilog para enviar trazas enriquecidas a Elasticsearch o Application Insights."
        }
      ]
    }
  ]
}