{
  "id": "edi-sterling-ssr",
  "title": "Evaluación Pre-screening: Especialista EDI / IBM Sterling (Semi-Senior/Senior)",
  "categories": [
    {
      "id": "cat-edi-standards",
      "title": "Conocimiento en Estándares EDI (ANSI X12 / EDIFACT)",
      "questions": [
        {
          "id": "q-edi-1",
          "question": "¿Cuál es tu experiencia interpretando y solucionando problemas en transacciones X12 (ej. 850, 856, 810) y EDIFACT (ej. ORDERS, DESADV, INVOIC)?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Ej. (Nivel 3-4): 'Un socio enviaba un 856 (ASN) donde el bucle HIL (jerarquía) no coincidía con nuestra estructura de pallets. Tuve que analizar el 'raw EDI', identificar la discrepancia en los segmentos LIN y HIL, y coordinar con el socio la corrección del mapeo en su lado.'"
        },
        {
          "id": "q-edi-2",
          "question": "Describe cómo manejas las estructuras de control (ISA/GS en X12, UNB/UNG en EDIFACT) y la importancia de los acuses de recibo (ej. 997, CONTRL).",
          "type": "scale",
          "scaleMax": 5,
          "example": "Ej. (Nivel 3-4): 'Configuré los 'envelopes' (sobres) en Sterling B2Bi para validar los IDs de ISA/GS contra la base de datos de socios. Además, creé un BP que, tras recibir un 850, genera y envía automáticamente un 997 (Functional Acknowledgement) validando la sintaxis del archivo.'"
        }
      ]
    },
    {
      "id": "cat-ibm-tools",
      "title": "Herramientas IBM (Sterling B2B Integrator y File Gateway)",
      "questions": [
        {
          "id": "q-ibm-1",
          "question": "¿Cuál es tu experiencia en el diseño, desarrollo y depuración de Business Processes (BP) en IBM Sterling B2B Integrator (B2Bi)?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Ej. (Nivel 3-4): 'Diseñé un BP complejo usando el GPM (Graphical Process Modeler) que recibía un archivo, invocaba el servicio de traducción (mapa), usaba 'xpath' para hacer 'content-based routing' y finalmente llamaba a un sub-proceso para la entrega vía SFTP.'"
        },
        {
          "id": "q-ibm-2",
          "question": "Describe tu experiencia configurando socios ('partners') y canales de enrutamiento ('routing channels') en IBM Sterling File Gateway (SFG).",
          "type": "scale",
          "scaleMax": 5,
          "example": "Ej. (Nivel 3-4): 'Realicé el 'onboarding' de un nuevo socio en SFG: creé su comunidad, configuré su 'mailbox' virtual, y definí un 'routing channel template' que tomaba cualquier archivo de su buzón y lo enviaba a un BP específico en B2Bi para su procesamiento y traducción.'"
        }
      ]
    },
    {
      "id": "cat-mapping",
      "title": "Mapeo y Transformación de Datos (IDOC, XML, JSON)",
      "questions": [
        {
          "id": "q-map-1",
          "question": "Describe tu experiencia desarrollando mapas en Sterling B2B Integrator, por ejemplo, transformando un IDOC de SAP (ej. ORDERS05) a un EDI X12 850 (Orden de Compra).",
          "type": "scale",
          "scaleMax": 5,
          "example": "Ej. (Nivel 3-4): 'Desarrollé un mapa donde el segmento E1EDK01 (cabecera) del IDOC se mapeaba a los segmentos BEG y N1 del 850. Usé 'extended rules' (reglas extendidas) para concatenar campos y 'user exits' para una lógica de conversión de fechas que el mapa estándar no soportaba.'"
        },
        {
          "id": "q-map-2",
          "question": "¿Cómo has manejado la integración de formatos no-EDI, como JSON o XML, dentro de los flujos de B2Bi?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Ej. (Nivel 3-4): 'Integramos una API REST. El BP recibía un JSON, usaba el servicio 'JSON-to-XML converter' y luego aplicaba un mapa (usando el 'translator') para convertir ese XML a un formato plano (flat file) que requería el ERP.'"
        }
      ]
    },
    {
      "id": "cat-protocols",
      "title": "Protocolos de Comunicación (SFTP, AS2, HTTP)",
      "questions": [
        {
          "id": "q-proto-1",
          "question": "Describe el proceso que sigues para configurar una conexión AS2 (Applicability Statement 2) con un nuevo socio, incluyendo el intercambio de certificados.",
          "type": "scale",
          "scaleMax": 5,
          "example": "Ej. (Nivel 3-4): 'Generamos nuestro par de claves (pública/privada) en B2Bi, exportamos el certificado público y se lo enviamos al socio. Ellos nos enviaron el suyo. Lo importamos en B2Bi y configuramos el perfil del socio con su AS2 ID, su URL y su certificado para cifrado y firma (MDN).'"
        },
        {
          "id": "q-proto-2",
          "question": "¿Cuál es tu experiencia configurando adaptadores SFTP (cliente y servidor) o clientes HTTP para consumir APIs?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Ej. (Nivel 3-4): 'Configuré un 'SFTP Client Adapter' para conectarnos a un servidor externo usando autenticación por clave SSH (no por contraseña). El BP utilizaba este adaptador en un servicio para 'poner' (Put) archivos en un directorio remoto específico después de su traducción.'"
        }
      ]
    },
    {
      "id": "cat-sdlc",
      "title": "Ciclo de Vida del Desarrollo (SDLC) en B2Bi",
      "questions": [
        {
          "id": "q-sdlc-1",
          "question": "¿Cómo gestionas el despliegue de nuevos mapas, BPs y configuraciones entre entornos (Desarrollo, QA, Producción) en la plataforma Sterling?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Ej. (Nivel 3-4): 'Usábamos 'Resource Manager' (exportación/importación de 'tags' o 'check-in/check-out') para mover los artefactos (mapas, BPs, 'envelopes'). Para configuraciones sensibles (como contraseñas), las excluíamos y las configurábamos manualmente en Producción.'"
        },
        {
          "id": "q-sdlc-2",
          "question": "Describe tu enfoque para las pruebas (unitarias y de integración) de un nuevo flujo EDI y cómo monitoreas los flujos en producción.",
          "type": "scale",
          "scaleMax": 5,
          "example": "Ej. (Nivel 3-4): 'Para pruebas unitarias, usaba el 'map editor' para probar el mapa con archivos de ejemplo. En QA, ejecutaba el BP completo. En producción, monitoreábamos activamente el 'File Gateway activity monitor' y el 'B2Bi dashboard' para fallos (HALT) y usábamos 'Correlation Data' para rastrear documentos.'"
        }
      ]
    }
  ]
}