{
  "id": "react-native-frontend",
  "title": "Evaluación de Expertiz en React Native",
  "categories": [
    {
      "id": "mobile-architecture-performance",
      "title": "Arquitectura y Rendimiento Móvil",
      "questions": [
        {
          "id": "spa-frameworks",
          "question": "¿Qué tanto dominas el ecosistema de React Native, incluyendo el manejo de New Architecture (Fabric/TurboModules) y el ciclo de vida de componentes?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Optimización de listas pesadas mediante FlashList en lugar de FlatList y comprensión de la comunicación sincrónica a través de JSI."
        },
        {
          "id": "clean-code-solid",
          "question": "¿Cómo aplicas principios SOLID y Clean Code para mantener una base de código escalable en aplicaciones móviles multiplataforma?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Implementación de Custom Hooks para separar la lógica de negocio de la UI y uso de 'Compound Components' para componentes de interfaz complejos."
        },
        {
          "id": "architectural-patterns",
          "question": "¿Qué nivel de experiencia tienes diseñando arquitecturas modulares para React Native (ej. Atomic Design o Feature-First)?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Estructuración de un proyecto donde las capas de datos, UI y navegación están claramente desacopladas, facilitando la reutilización de código en Web vía React Native Web."
        },
        {
          "id": "scalability-design",
          "question": "¿Cuál es tu capacidad para diseñar aplicaciones móviles que mantengan un alto rendimiento a medida que crece el volumen de datos y la complejidad de la navegación?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Uso de React Navigation con optimización de 'native stack' y gestión de estados globales complejos sin causar re-renders innecesarios en toda la app."
        }
      ]
    },
    {
      "id": "data-security-integration",
      "title": "Integración de Datos y Seguridad Móvil",
      "questions": [
        {
          "id": "api-rest-standards",
          "question": "¿Qué tanta experiencia tienes consumiendo servicios RESTful y manejando estados de carga/error en condiciones de red inestables?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Implementación de React Query o RTK Query para caching, sincronización en segundo plano y manejo de 'Optimistic Updates' en la UI."
        },
        {
          "id": "authentication-authorization",
          "question": "¿Cuál es tu nivel de conocimiento en flujos de autenticación móvil, incluyendo OAuth2, Biometría y persistencia de tokens?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Implementación de Login con FaceID/TouchID utilizando react-native-biometrics e integración con servicios como Auth0 o Firebase Auth."
        },
        {
          "id": "secrets-management",
          "question": "¿Cómo gestionas de forma segura las claves de API y la información sensible dentro de un binario móvil?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Uso de react-native-keychain para almacenamiento seguro de credenciales y react-native-config para inyectar variables de entorno en tiempo de compilación."
        },
        {
          "id": "nosql-data-modeling",
          "question": "¿Qué experiencia tienes con bases de datos locales y persistencia fuera de línea (Offline-first)?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Modelado de datos utilizando WatermelonDB o Realm para manejar grandes volúmenes de datos con sincronización perezosa (lazy-loading)."
        }
      ]
    },
    {
      "id": "quality-infrastructure",
      "title": "Calidad, Testing y DevOps Móvil",
      "questions": [
        {
          "id": "unit-testing-mocking",
          "question": "¿Qué tan hábil eres realizando pruebas unitarias y de hooks en React Native?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Uso de React Native Testing Library y Jest para simular interacciones de usuario y verificar el comportamiento de componentes que dependen de contextos."
        },
        {
          "id": "integration-testing",
          "question": "¿Cuál es tu experiencia realizando pruebas de integración y manejo de fallos en dispositivos reales o emuladores?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Configuración de pruebas de flujo completo para asegurar que la navegación entre pantallas y el envío de formularios funcionen correctamente con mocks de API."
        },
        {
          "id": "ci-cd-automation",
          "question": "¿Qué dominio tienes sobre el ciclo de vida de despliegue y automatización (CI/CD) para iOS y Android?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Configuración de Fastlane para automatizar la firma de código (Code Signing), generación de builds y subida a TestFlight o Google Play Console."
        },
        {
          "id": "monitoring-alerting",
          "question": "¿Cómo implementas estrategias de monitoreo de crashes y observabilidad en una aplicación productiva?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Integración de Sentry o Firebase Crashlytics para capturar 'Source Maps' de JavaScript y diagnosticar errores en producción de forma precisa."
        }
      ]
    },
    {
      "id": "collaboration-docs",
      "title": "Colaboración y Documentación",
      "questions": [
        {
          "id": "collaborative-programming",
          "question": "¿Qué tanta experiencia tienes liderando revisiones de código y estandarizando prácticas de desarrollo en equipos móviles?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Definición de reglas de ESLint/Prettier específicas para React Native y liderazgo de sesiones de Pair Programming para resolver bugs complejos de memoria."
        },
        {
          "id": "technical-documentation",
          "question": "¿Cuál es tu capacidad para documentar arquitecturas móviles, esquemas de navegación o procesos de build?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Creación de archivos README detallados sobre la configuración del entorno nativo (CocoaPods, Gradle) y diagramas de flujo de datos de la aplicación."
        }
      ]
    }
  ]
}