{
  "id": "springboot-backend",
  "title": "Evaluación Técnica - Java Spring Boot Backend",
  "categories": [
    {
      "id": "core-engineering",
      "title": "Ingeniería de Software y Core Java",
      "questions": [
        {
          "id": "buenas-practicas",
          "question": "¿Qué nivel de experiencia tienes aplicando principios como SOLID, DRY, KISS y Clean Code para garantizar la mantenibilidad?",
          "type": "scale",
          "scaleMax": 4,
          "example": "Refactorizar una clase monolítica aplicando el Principio de Responsabilidad Única (SRP) y utilizando Inyección de Dependencias para desacoplar componentes, facilitando los tests unitarios."
        },
        {
          "id": "lenguaje-de-programacion",
          "question": "¿Cómo evaluarías tu dominio profundo de Java (versiones recientes 17/21), incluyendo gestión de memoria, concurrencia y Streams API?",
          "type": "scale",
          "scaleMax": 4,
          "example": "Uso de CompletableFuture para orquestar llamadas asíncronas a múltiples APIs externas y combinar resultados, o implementación de Virtual Threads para optimizar el throughput en aplicaciones I/O bound."
        },
        {
          "id": "framework",
          "question": "¿Cuál es tu nivel de experticia en el ecosistema Spring Boot (Ciclo de vida, Auto-configuración, AOP y Transacciones)?",
          "type": "scale",
          "scaleMax": 4,
          "example": "Creación de una anotación personalizada con AOP para auditoría de métodos sensibles o la implementación de un 'Custom Spring Boot Starter' para estandarizar configuraciones en múltiples microservicios."
        }
      ]
    },
    {
      "id": "architecture-design",
      "title": "Arquitectura y Diseño de Sistemas",
      "questions": [
        {
          "id": "patrones-de-diseno",
          "question": "¿Qué tanta experiencia tienes identificando e implementando patrones de diseño (GoF, Enterprise Integration Patterns) en problemas reales?",
          "type": "scale",
          "scaleMax": 4,
          "example": "Implementación del patrón Strategy inyectando un Map<String, ServiceInterface> en Spring para seleccionar dinámicamente la lógica de negocio basada en un parámetro de entrada."
        },
        {
          "id": "arquitectura",
          "question": "¿Qué nivel de dominio tienes definiendo y trabajando con arquitecturas modernas (Microservicios, Hexagonal/Clean, Event-Driven)?",
          "type": "scale",
          "scaleMax": 4,
          "example": "Diseño de una aplicación con Arquitectura Hexagonal donde el dominio está totalmente aislado del framework Spring y de la persistencia, utilizando puertos y adaptadores."
        },
        {
          "id": "integracion",
          "question": "¿Cómo calificarías tu capacidad para diseñar integraciones robustas (REST, GraphQL, gRPC) y manejar mensajería asíncrona?",
          "type": "scale",
          "scaleMax": 4,
          "example": "Implementación del patrón Saga (Orquestación o Coreografía) utilizando Kafka o RabbitMQ para manejar transacciones distribuidas entre múltiples microservicios con consistencia eventual."
        }
      ]
    },
    {
      "id": "data-persistence",
      "title": "Persistencia y Datos",
      "questions": [
        {
          "id": "base-datos-relacionales",
          "question": "¿Qué tan profundo es tu dominio de SQL, modelado de datos y optimización de ORM (JPA/Hibernate) en entornos de alta concurrencia?",
          "type": "scale",
          "scaleMax": 4,
          "example": "Solución del problema 'N+1 Selects' utilizando @EntityGraph o JOIN FETCH en JPQL, y optimización de consultas mediante análisis del Execution Plan e índices compuestos."
        },
        {
          "id": "base-datos-nosql",
          "question": "¿Qué experiencia tienes seleccionando e implementando soluciones NoSQL (MongoDB, Redis, Cassandra) según el caso de uso?",
          "type": "scale",
          "scaleMax": 4,
          "example": "Implementación de una estrategia de caché 'Look-aside' o 'Write-through' con Redis para reducir la latencia de lectura en datos de acceso frecuente, configurando TTLs y políticas de desalojo."
        }
      ]
    },
    {
      "id": "devops-quality",
      "title": "Calidad, Seguridad y DevOps",
      "questions": [
        {
          "id": "cloud",
          "question": "¿Cuál es tu nivel de conocimiento sobre servicios Cloud (AWS/Azure/GCP) y patrones nativos de la nube?",
          "type": "scale",
          "scaleMax": 4,
          "example": "Uso de Spring Cloud AWS para integrar SQS y S3, manejando credenciales vía roles IAM y utilizando Secrets Manager para la configuración sensible."
        },
        {
          "id": "control-versiones",
          "question": "¿Qué tan cómodo te sientes con el manejo avanzado de Git y estrategias de flujo de trabajo (GitFlow, Trunk Based Development)?",
          "type": "scale",
          "scaleMax": 4,
          "example": "Resolución de conflictos complejos en rebases interactivos y gestión de 'Feature Flags' para permitir Trunk Based Development sin romper producción."
        },
        {
          "id": "testing",
          "question": "¿Qué nivel de dominio tienes implementando estrategias de pruebas automatizadas (Unitarias, Integración, Contrato y E2E)?",
          "type": "scale",
          "scaleMax": 4,
          "example": "Uso de Testcontainers para levantar instancias reales de PostgreSQL y Kafka durante los tests de integración, asegurando que el código funciona con la infraestructura real y no solo con mocks."
        },
        {
          "id": "contenedores",
          "question": "¿Qué tanta experiencia tienes en la containerización (Docker) y orquestación (Kubernetes) de aplicaciones Java?",
          "type": "scale",
          "scaleMax": 4,
          "example": "Creación de un Dockerfile 'Multi-stage build' para generar una imagen ligera (distroless) de la aplicación Spring Boot, definiendo correctamente los límites de recursos (CPU/RAM) para Kubernetes."
        },
        {
          "id": "despliegue-ci-cd",
          "question": "¿Qué capacidad tienes para diseñar y mantener pipelines de CI/CD utilizando herramientas como Jenkins, GitHub Actions o GitLab CI?",
          "type": "scale",
          "scaleMax": 4,
          "example": "Configuración de un pipeline que ejecuta análisis estático (SonarQube), tests, construye la imagen, la firma digitalmente y realiza un despliegue Blue/Green en el clúster."
        },
        {
          "id": "seguridad",
          "question": "¿Cuál es tu nivel de experiencia implementando seguridad en aplicaciones (OWASP, OAuth2, OIDC, JWT)?",
          "type": "scale",
          "scaleMax": 4,
          "example": "Configuración de Spring Security como Resource Server validando JWTs, implementando CSRF protection y manejando roles y scopes personalizados extraídos del token."
        },
        {
          "id": "monitoreo-sre-basico",
          "question": "¿Qué experiencia tienes implementando observabilidad, logging centralizado y métricas en sistemas distribuidos?",
          "type": "scale",
          "scaleMax": 4,
          "example": "Instrumentación de la aplicación con Micrometer para exponer métricas de negocio personalizadas a Prometheus y uso de OpenTelemetry para trazabilidad distribuida."
        }
      ]
    },
    {
      "id": "soft-skills",
      "title": "Habilidades Blandas y Liderazgo",
      "questions": [
        {
          "id": "comunicacion",
          "question": "¿Qué tan efectivo te consideras comunicando conceptos técnicos complejos a audiencias tanto técnicas como no técnicas?",
          "type": "scale",
          "scaleMax": 4,
          "example": "Explicar los trade-offs del Teorema CAP a un Product Owner para justificar por qué se eligió consistencia eventual sobre consistencia fuerte en una feature específica."
        },
        {
          "id": "trabajo-en-equipo",
          "question": "¿Cómo evaluarías tu habilidad para colaborar, mentorear a juniors y resolver conflictos técnicos de manera constructiva?",
          "type": "scale",
          "scaleMax": 4,
          "example": "Realizar Code Reviews constructivos que no solo señalan errores, sino que explican el 'por qué' y sugieren mejoras educativas, elevando el nivel técnico del equipo."
        }
      ]
    }
  ]
}