{
  "id": "springboot-backend",
  "title": "Evaluación Técnica: Spring Boot & Cloud Architecture",
  "categories": [
    {
      "id": "core-backend-architecture",
      "title": "Arquitectura Backend y Framework",
      "questions": [
        {
          "id": "backend-framework-mastery",
          "question": "¿Cuál es tu nivel de dominio en el ecosistema de Spring (Boot, Data, Security, Context) y el manejo de Inversión de Control?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Uso de perfiles condicionales (@Profile), configuración de beans mediante @Configuration y manejo avanzado del ciclo de vida de los componentes."
        },
        {
          "id": "api-rest-standards",
          "question": "¿Qué tanta experiencia posees diseñando APIs RESTful bajo estándares profesionales y versionado en Spring MVC?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Implementación de HATEOAS, negociación de contenido, versionado por headers o URL y uso de Swagger/OpenAPI para documentación técnica activa."
        },
        {
          "id": "clean-code-solid",
          "question": "¿Cómo calificarías tu capacidad para aplicar principios SOLID y patrones de diseño dentro de una aplicación Spring?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Aplicación del patrón Strategy para múltiples implementaciones de un servicio o uso de decoradores para extender funcionalidades de Repositories."
        },
        {
          "id": "architectural-patterns",
          "question": "¿Qué experiencia tienes implementando arquitecturas limpias como Hexagonal u Onion en proyectos Spring Boot?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Desacoplamiento total del dominio mediante puertos (interfaces) y adaptadores (Spring Data JPA, RestControllers) para evitar la contaminación del framework."
        }
      ]
    },
    {
      "id": "persistence-resilience",
      "title": "Persistencia de Datos y Resiliencia",
      "questions": [
        {
          "id": "sql-optimization",
          "question": "¿Cuál es tu nivel de experticia optimizando el acceso a datos y el uso de ORM (Hibernate/JPA)?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Resolución del problema de consultas N+1 mediante @EntityGraph o 'join fetch', y afinamiento de transacciones con niveles de aislamiento específicos."
        },
        {
          "id": "resilience-fault-tolerance",
          "question": "¿Qué tanta experiencia tienes implementando patrones de tolerancia a fallos mediante Resilience4j en arquitecturas distribuidas?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Configuración de Circuit Breakers y Rate Limiters para proteger servicios críticos contra fallos en cascada de dependencias externas."
        },
        {
          "id": "messaging-queues-brokers",
          "question": "¿Cuál es tu dominio integrando Spring Boot con Message Brokers como RabbitMQ o Apache Kafka?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Implementación de consumidores concurrentes, manejo de Dead Letter Queues (DLQ) y estrategias de reintento asíncronas."
        }
      ]
    },
    {
      "id": "security-quality",
      "title": "Seguridad y Calidad de Software",
      "questions": [
        {
          "id": "authentication-authorization",
          "question": "¿Qué tan sólido es tu conocimiento en Spring Security, flujos OAuth2 y JWT?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Configuración de un Resource Server con validación de tokens JWT y autorización basada en métodos mediante @PreAuthorize."
        },
        {
          "id": "unit-testing-mocking",
          "question": "¿Cuál es tu experiencia realizando pruebas unitarias y mocks en Spring Boot (JUnit 5, Mockito)?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Uso de @ExtendWith(MockitoExtension.class) para aislar lógica de negocio y asegurar el 100% de cobertura en servicios críticos."
        },
        {
          "id": "integration-testing",
          "question": "¿Qué tanto dominas las pruebas de integración en Spring, especialmente con Testcontainers?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Levantamiento de instancias reales de PostgreSQL o Kafka en Docker durante la fase de test para validar la persistencia real."
        },
        {
          "id": "secrets-management",
          "question": "¿Cómo gestionas la seguridad de credenciales y secretos en aplicaciones Spring Cloud?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Integración de Spring Cloud Vault o AWS Secrets Manager para inyectar propiedades sensibles sin exponerlas en archivos de configuración."
        }
      ]
    },
    {
      "id": "infrastructure-devops",
      "title": "Infraestructura y Operaciones",
      "questions": [
        {
          "id": "containerization-tech",
          "question": "¿Qué nivel de experiencia tienes dockerizando microservicios Spring Boot de forma optimizada?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Uso de 'multi-stage builds' y capas de dependencias (layers) para reducir el tiempo de construcción y el tamaño de la imagen final."
        },
        {
          "id": "monitoring-alerting",
          "question": "¿Cómo implementas la observabilidad en Spring Boot mediante Micrometer y Actuator?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Exposición de métricas personalizadas para Prometheus y configuración de 'Health Indicators' para orquestadores como Kubernetes."
        },
        {
          "id": "ci-cd-automation",
          "question": "¿Qué tanta participación has tenido en la automatización de pipelines de despliegue para artefactos .jar o imágenes Docker?",
          "type": "scale",
          "scaleMax": 5,
          "example": "Configuración de Jenkinsfiles o GitHub Actions para ejecutar el ciclo 'mvn clean verify' antes de promocionar a entornos productivos."
        }
      ]
    }
  ]
}